chapter13/boxInBoxRefined/0/CourantNo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.006";
    object      CourantNo;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24400
(
8.31116e-10
1.09993e-09
1.22874e-09
1.25465e-09
1.20185e-09
1.09428e-09
9.53361e-10
7.95122e-10
...
)
;

boundaryField
{
    REST
    {
        type            zeroGradient;
    }
    ZMAX
    {
        type            zeroGradient;
    }
    ZMIN
    {
        type            zeroGradient;
    }
    HULL
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
