chapter13/boxInBoxRefined/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    REST
    {
        /*type slip; */

        type            zeroGradient;

        /*type            fixedValue; */
        /*value           uniform (0 0 1);*/

        /*type            movingWallVelocity;*/
        /*type            fixedValue; */
        /*value           uniform (0 0 -0.5);*/

        /*type            movingWallVelocity;*/
        /*value uniform (0 0 0); */
    }
    ZMAX
    {
        type            zeroGradient;

        /*type            fixedValue; */
        /*value           uniform (0 0 1);*/

        /*type            movingWallVelocity;*/
        /*type            fixedValue; */
        /*value           uniform (0 0 -0.5);*/

        /*type            movingWallVelocity;*/
        /*value uniform (0 0 0); */

    }
    ZMIN 
    {
        /*type            zeroGradient;*/

        /*type            fixedValue; */
        /*value           uniform (0 0 1);*/

        type            fixedValue; 
        value           uniform (0 0 0);

        /*type            movingWallVelocity;*/
        /*type            fixedValue; */
        /*value           uniform (0 0 -0.5);*/

        /*type            movingWallVelocity;*/
        /*value uniform (0 0 0);*/
    }
    HULL
    {
        type            zeroGradient;
        /*type            movingWallVelocity;*/
        /*type            fixedValue; */
        /*value           uniform (0 0 0);*/
    }
}


// ************************************************************************* //
