chapter13/boxInBoxRefined/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24400
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    REST
    {
        type            zeroGradient;
    }
    ZMAX
    {
        type            zeroGradient;
    }
    ZMIN
    {
        type            zeroGradient;
    }
    HULL
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
