chapter13/boxInBoxRefined/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    REST
    {
        /*type            zeroGradient;*/
        /*type            fixedValue;*/
        /*value           uniform 0;*/

        type            zeroGradient;
    }
    ZMAX
    {
        /*type            totalPressure;*/
        /*rho             rho;*/
        /*psi             none;*/
        /*gamma           1;*/
        /*p0              uniform 0;*/
        /*value           uniform 0;*/

        type            zeroGradient;
    }
    ZMIN 
    {
        type            zeroGradient;
        /*type            totalPressure;*/
        /*rho             rho;*/
        /*psi             none;*/
        /*gamma           1;*/
        /*p0              uniform 0;*/
        /*value           uniform 0;*/
    }
    HULL
    {
        type            zeroGradient; 
    }
}


// ************************************************************************* //
