chapter13/boxInBoxRefined/constant/HULL
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x-gitClone                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HULL;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patchNames      ( HULL );

masses          1 ( 9.6 );

momentsOfInertia ( ( 0.08622222  0 0 0 0.08622222 0 0 0 0.144 ) );

massPositions   1 ( ( 0.5 0.5 0 ) );

PoAExternalForces ( 0 0 0 );

allowTranslation ( 0 0 0 );

allowRotation ( 1 0 0 );

wholeGridTranslation ( 0 0 0 );

wholeGridRotation ( 0 0 0 );

relaxForces     0.9;

forceResidual   1.e-04;

tRamp0          tRamp0 [ 0 0 1 0 0 0 0 ] 0.0;

tRamp           tRamp [ 0 0 1 0 0 0 0 ] 0.0; 

computeCutLoads off;


// ************************************************************************* //

