chapter13/boxInBoxRefined/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicSolidBodyMotionRefinedFvMesh;

dynamicSolidBodyMotionRefinedFvMeshCoeffs
{
    solidBodyMotionFunction linearMotion;

    linearMotionCoeffs
    {
        velocity (0 0 -0.5);
    }

}


dynamicRefineFvMeshCoeffs
{
    // How often to refine
    refineInterval  1;
    // Field to be refinement on
    field           alpha1;
    // Refine field inbetween lower..upper
    lowerRefineLevel 0.00001;
    upperRefineLevel 0.999;
    // If value < unrefineLevel unrefine
    unrefineLevel   10;
    // Have slower than 2:1 refinement
    nBufferLayers   2;
    // Refine cells only up to maxRefinement levels
    maxRefinement   1;
    // Stop refinement if maxCells reached
    maxCells        100000;
    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        /*(phi Urel)*/
        /*(phi U)*/
        (phi none)

        /*(phiAbs U)*/
        (phiAbs none)

        /*(phiAbs_0 U_0)*/
        (phiAbs_0 none)

        (nHatf none)
        (rho*phi none)
        (ghf none)
        (phi_0 none)
    );
    // Write the refinement level as a volScalarField
    dumpLevel       false;
}


// ************************************************************************* //
